Repository: iblueer/TinyPNG4Mac
Catalog: TinyPNG4Mac/TinyPNG4Mac/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: "Save As Mode" is selected. Please config the output directory first.
zh_hans: “另存为模式”已启用，请先设置输出目录

source: "Tiny Image" (TinyPNG4Mac) is a 3rd-party client for [TinyPNG](https://tinypng.com).
zh_hans: “Tiny Image” (TinyPNG4Mac) 是 [TinyPNG](https://tinypng.com) 的第三方客户端。

# %lld tasks, %@
source: %1$lld tasks, %2$@
zh_hans: %1$lld 任务，%2$@

source: About Tiny Image
zh_hans: 关于 Tiny Image

source: About...
zh_hans: 关于…

source: All compressed images will be replaced with the origin file.
zh_hans: 所有压缩完成的图片将会被恢复成原始文件。

source: API Key
zh_hans: API 密钥

source: API Key Status
zh_hans: API 密钥状态

source: API keys are automatically applied and managed.
zh_hans: API 密钥将自动申请和管理。

source: Apply New
zh_hans: 申请新密钥

source: Applying new key...
zh_hans: 正在申请新密钥...

source: Auto
zh_hans: 自动

source: Auto Key Mode
zh_hans: 自动密钥模式

source: Auto Keys
zh_hans: 自动密钥

source: Available Keys
zh_hans: 可用密钥

source: Cancel
zh_hans: 取消

source: Cancelled
zh_hans: 已取消

source: Clear
zh_hans: 清除

source: Clear all finished tasks
zh_hans: 清除全部已结束任务

source: Clear all tasks
zh_hans: 清除全部任务

source: Clear Output Directory
zh_hans: 清除输出目录

source: Click to open:
zh_hans: 点击打开：

source: Completed
zh_hans: 已完成

source: Completed:
zh_hans: 已完成：

source: Compress again
zh_hans: 再次压缩

source: Concurrent Tasks
zh_hans: 并行任务数量

source: Concurrent tasks:
zh_hans: 并行任务数量：

source: Confirm quit?
zh_hans: 确认退出？

source: Confirm to restore all the images?
zh_hans: 确认恢复所有图片？

source: Confirm to restore the image?
zh_hans: 确认恢复图片？

source: Convert Images to:
zh_hans: 将图片格式转换为：

source: Copyright
zh_hans: 版权信息（Copyright）

source: Creation
zh_hans: 创建者信息（Creation）

source: Creation Date
zh_hans: 创建日期

source: Debug
zh_hans: 调试

source: Debug Log
zh_hans: 调试日志

source: Disable "Overwrite Mode" after selecting the output directory.
zh_hans: 请选择输出目录后禁用“覆盖模式”

source: Downloading
zh_hans: 下载中

source: Drop images or folders here!
zh_hans: 拖拽图片或目录开始

source: Failed
zh_hans: 失败

source: Failed to create output directory: %@, please re-select the output directory.
zh_hans: 创建输出目录 “%@” 失败，请重新设置输出目录。

source: Failed to save output directory
zh_hans: 保存输出目录失败

source: File does not exists
zh_hans: 文件不存在

source: Images compressed this month: %@
zh_hans: 当月已压缩图片数量： %@

source: Invalid Directory
zh_hans: 无效目录

source: Keep origin
zh_hans: 保留原格式

source: Keep origin format
zh_hans: 保留原格式

source: Location
zh_hans: 位置信息（Location）

source: Made by [@kyleduo](https://github.com/kyleduo) ❤︎ Open-sourced on [Github](https://github.com/kyleduo/TinyPNG4Mac)
zh_hans: 由 [@kyleduo](https://github.com/kyleduo) 制作 ❤︎ 在 [Github](https://github.com/kyleduo/TinyPNG4mac) 上开源

source: No log messages
zh_hans: 暂无日志

source: No recent activity
zh_hans: 暂无活动

source: No write permission of output folder %@, please re-select the output directory.
zh_hans: 缺少输出目录 “%@” 的权限，请重新选择输出目录。

source: OK
zh_hans: 好

source: Open Compressed Image
zh_hans: 打开已压缩图片

source: Open Origin Image
zh_hans: 打开原始图片

source: Output
zh_hans: 输出

source: Output directory is not set yet, please select it in the settings window.
zh_hans: 输出目录尚未设置，请在设置窗口中设置。

source: Output directory:
zh_hans: 输出目录：

source: Overwrite
zh_hans: 覆盖

source: Overwrite Mode: The compressed image will replace the original file. The original image is kept temporarily and can be restored before exit the app. Save As Mode: The compressed image is saved as a new file, leaving the original image unchanged. You can choose where to save the compressed images.
zh_hans: 覆盖模式： 压缩后的图像将替换原始文件。原始图像会暂时保留，并且可以在退出应用之前恢复。 另存为模式： 压缩后的图像会保存为一个新文件，原始图像不会被修改。你可以在下面选择压缩图像保存的位置。

source: Pending
zh_hans: 排队中

source: Please select a different directory.
zh_hans: 请选择其他目录。

source: Please set the API key first.
zh_hans: 请先设置 API key

source: Preserve Metadata
zh_hans: 保留元数据

source: Preserve:
zh_hans: 保留信息：

source: Processing
zh_hans: 处理中

source: Quit
zh_hans: 退出

source: Quota
zh_hans: 配额

source: Recent Activity
zh_hans: 最近活动

source: Restore
zh_hans: 恢复

source: Restore all compressed images
zh_hans: 恢复全部已压缩图片

source: Restore Origin Image
zh_hans: 恢复原始图片

source: Restored
zh_hans: 已恢复

source: Retry all failed tasks
zh_hans: 重试全部失败任务

source: Retry the task
zh_hans: 重试任务

source: Reveal Compressed Image in Finder
zh_hans: 打开已压缩图片

source: Reveal Compressed in Finder
zh_hans: 打开已压缩图片目录

source: Reveal in Finder
zh_hans: 打开原始图片目录

source: Reveal Origin Image in Finder
zh_hans: 打开原始图片

source: Save As
zh_hans: 另存为

source: Save Mode
zh_hans: 保存模式

source: Save Mode:
zh_hans: 保存模式：

source: Select output directory
zh_hans: 选择输出目录

source: Select...
zh_hans: 选择...

source: Settings
zh_hans: 设置

source: Supports WebP, PNG, and JPEG images.
zh_hans: 支持 WebP, PNG 和 JPEG 图片

source: Tasks
zh_hans: 任务

source: The config is not ready
zh_hans: 请先完成设置

source: The image at "%@" will be replaced with the origin file.
zh_hans: "%@" 位置的图片将被替换成原始文件

source: The output directory does not exist. It will be automatically created after any task is completed.
zh_hans: 输出目录不存在。任意任务完成后会自动创建。

source: There are ongoing tasks. Quitting will cancel them all.
zh_hans: 有正在进行中的任务，退出应用会取消所有任务。

source: TinyPNG holds the final right of interpretation regarding the image compression functionality and results.
zh_hans: TinyPNG 保留图片压缩功能和压缩结果的最终解释权。

source: Total:
zh_hans: 全部：

source: Uploading
zh_hans: 上传中

source: Use the smallest format automatically
zh_hans: 自动使用最小的格式

source: Visit [https://tinypng.com/developers](https://tinypng.com/developers) to request an API key.
zh_hans: 访问 [https://tinypng.com/developers](https://tinypng.com/developers) 申请 API key。

source: When "Save As Mode" is enabled, the compressed image will be saved to this directory. If a file with the same name exists, it will be overwritten.
zh_hans: 当启用“另存为模式”时，压缩后的图像将保存到该目录。如果存在同名文件，将被覆盖。
